src/cf/DataProcessors/GDS_ЗагрузкаЗаправочныхВедомостей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>GDS_ЗагрузкаЗаправочныхВедомостей</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/GDS_СоответсвиеДокументовПисьмам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>GDS_СоответсвиеДокументовПисьмам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Успех</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛогOCR</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДанныеOCRСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.GDS_ЗаправочнаяВедомость</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Письмо</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоВходящее</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Documents/ЭлектронноеПисьмоВходящее.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЭлектронноеПисьмоВходящее</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыВажностиВзаимодействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнутреннийЗаголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПолучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьВложения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторНаСервере</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторыОснований</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кодировка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправительАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправительКонтакт</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КонтактВзаимодействия</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправительПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокПолучателейКопий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокПолучателейПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТекста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыТекстовЭлектронныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВзаимодействиеОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоВходящее</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УведомитьОДоставке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УведомитьОПрочтении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешСумма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПолучателиПисьма</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контакт</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КонтактВзаимодействия</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПолучателиКопий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контакт</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КонтактВзаимодействия</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПолучателиОтвета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контакт</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КонтактВзаимодействия</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаборыЗначенийДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерНабора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уточнение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чтение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>АдресаУведомленияОПрочтении</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контакт</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КонтактВзаимодействия</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НепринятыеВложения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяВложение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/DataProcessors/GDS_ЗагрузкаЗаправочныхВедомостей/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем ПутьКУтилитеQR; // путь к извлечённой из макета утилите ZXing (gozxing)
Перем ПутьКУтилитеOCR; // путь к утилите FuelStatementOCR.exe

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Возвращает таблицу входящих писем для формы обработки.
//
// Возвращаемое значение:
//  ТаблицаЗначений - колонки: Письмо, Тема, Дата, Отправитель.
//
Функция СписокПисемДяОбработки() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЭлектронноеПисьмоВходящее.Ссылка КАК Письмо,
	|	ЭлектронноеПисьмоВходящее.Тема КАК Тема,
	|	ЭлектронноеПисьмоВходящее.ДатаПолучения КАК Дата,
	|	ЭлектронноеПисьмоВходящее.ОтправительПредставление КАК Отправитель
	|ИЗ
	|	Документ.ЭлектронноеПисьмоВходящее КАК ЭлектронноеПисьмоВходящее
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.GDS_СоответсвиеДокументовПисьмам КАК GDS_СоответсвиеДокументовПисьмам
	|		ПО ЭлектронноеПисьмоВходящее.Ссылка = GDS_СоответсвиеДокументовПисьмам.Письмо
	|ГДЕ
	|	НЕ ЭлектронноеПисьмоВходящее.ПометкаУдаления
	|	И GDS_СоответсвиеДокументовПисьмам.Документ ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЭлектронноеПисьмоВходящее.ДатаПолучения УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

// Обрабатывает одно входящее письмо: QR → ведомость → файл.
//
// Параметры:
//  Письмо - ДокументСсылка.ЭлектронноеПисьмоВходящее
//
// Возвращаемое значение:
//  Структура - Успех, Ведомость, Вложение, ТекстОшибки, ЛогOCR, ПредупреждениеOCR.
//
Функция ОбработатьПисьмо(Письмо) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Успех", Ложь);
	Результат.Вставить("Ведомость", Неопределено);
	Результат.Вставить("Вложение", "");
	Результат.Вставить("ТекстОшибки", "");
	Результат.Вставить("ЛогOCR", "");
	Результат.Вставить("ДанныеOCRСтрока", "");
	Результат.Вставить("ПредупреждениеOCR", Ложь);
	
	Попытка
		
		ДанныеВложения = НайтиQRВоВложениях(Письмо);
		Если ДанныеВложения = Неопределено Тогда
			Результат.ТекстОшибки = НСтр("ru = 'QR-код не найден ни в одном вложении (JPG/PNG/PDF).'");
			Возврат Результат;
		КонецЕсли;
		
		Результат.Вложение = ДанныеВложения.ИмяФайла;
		
		ДанныеQR = РазобратьДанныеQR(ДанныеВложения.QRСтрока);
		РезультатОбработки = ВедомостьПоДаннымQR(
			ДанныеQR,
			Письмо,
			ДанныеВложения.ДвоичныеДанные,
			ДанныеВложения.ИмяФайла,
			РасширениеФайла(ДанныеВложения.ИмяФайла));
		
		Результат.Успех = Истина;
		Результат.Ведомость = РезультатОбработки.Ведомость;
		Результат.ЛогOCR = РезультатОбработки.ЛогOCR;
		Результат.ДанныеOCRСтрока = РезультатОбработки.ДанныеOCRСтрока;
		Результат.ПредупреждениеOCR = РезультатОбработки.ПредупреждениеOCR;
		
	Исключение
		Результат.ТекстОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		
		Комментарий = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации("Обработка писем заправочных ведомостей", УровеньЖурналаРегистрации.Ошибка,
			, Письмо, Комментарий);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Проверяет доступность утилиты распознавания QR (макет КомпонентаQR).
//
// Возвращаемое значение:
//  Структура - Доступна (Булево), ТекстОшибки (Строка).
//
Функция ПроверитьКомпонентуРаспознаванияQR() Экспорт
	
	Результат = Новый Структура("Доступна, ТекстОшибки", Ложь, "");
	
	Попытка
		ПолучитьПутьКУтилитеQR();
		Результат.Доступна = Истина;
	Исключение
		Результат.ТекстОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НайтиQRВоВложениях(Письмо)
	
	Вложения = УправлениеЭлектроннойПочтой.ПолучитьВложенияЭлектронногоПисьма(Письмо, Ложь);
	
	Для Каждого СтрокаВложения Из Вложения Цикл
		
		Расширение = НРег(РасширениеФайла(СтрокаВложения.ИмяФайла));
		Если Не ДопустимоеРасширениеВложения(Расширение) Тогда
			Продолжить;
		КонецЕсли;
		
		ДвоичныеДанные = РаботаСФайлами.ДвоичныеДанныеФайла(СтрокаВложения.Ссылка);
		QRСтрока = РаспознатьQRИзДвоичныхДанных(ДвоичныеДанные, Расширение);
		
		Если ЗначениеЗаполнено(QRСтрока) Тогда
			Возврат Новый Структура("QRСтрока, ДвоичныеДанные, ИмяФайла", QRСтрока, ДвоичныеДанные, СтрокаВложения.ИмяФайла);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Функция РаспознатьQRИзДвоичныхДанных(ДвоичныеДанные, Расширение)
	
	РасширениеКартинки = Расширение;
	Если Расширение = "pdf" Тогда
		ДвоичныеДанные = ПреобразоватьPDFВPNG(ДвоичныеДанные);
		РасширениеКартинки = "png";
	КонецЕсли;
	
	Возврат ВызватьРаспознаваниеQR(ДвоичныеДанные, РасширениеКартинки);
	
КонецФункции

Функция РазобратьДанныеQR(QRСтрока)
	
	Данные = ОбщегоНазначения.JSONВЗначение(QRСтрока, , Ложь);
	
	Если ТипЗнч(Данные) <> Тип("Структура") Тогда
		ВызватьИсключение НСтр("ru = 'QR-код не содержит JSON-структуру.'");
	КонецЕсли;
	
	Если Не Данные.Свойство("ВедомостьУИН") Или Не ЗначениеЗаполнено(Данные.ВедомостьУИН) Тогда
		ВызватьИсключение НСтр("ru = 'В QR-коде отсутствует УИН ведомости.'");
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ВедомостьУИН", Данные.ВедомостьУИН);
	
	Возврат Результат;
	
КонецФункции

Функция ВедомостьПоДаннымQR(ДанныеQR, Письмо, ДвоичныеДанныеВложения, ИмяФайла, РасширениеВложения)
	
	Результат = Новый Структура;
	Результат.Вставить("Ведомость", Неопределено);
	
	РеквизитыПисьма = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Письмо, "ДатаПолучения");
	
	УИН = Новый УникальныйИдентификатор(ДанныеQR.ВедомостьУИН);
	Документ = Документы.GDS_ЗаправочнаяВедомость.ПолучитьСсылку(УИН);
	
	Если Не ОбщегоНазначения.СсылкаСуществует(Документ) Тогда
		Текст = СтрШаблон(НСтр("ru = 'Нет документа по УИН ведомости %1.
			|Письмо %2'"), ДанныеQR.ВедомостьУИН, ПолучитьНавигационнуюСсылку(Письмо));
		ВызватьИсключение Текст;
	КонецЕсли;
	
	ДокументОбъект = Документ.ПолучитьОбъект();
	
	ДокументОбъект.Дата = РеквизитыПисьма.ДатаПолучения;
	ДокументОбъект.Основание = Письмо;
	ДокументОбъект.ОбменДанными.Загрузка = Истина;
	
	НачатьТранзакцию();
	Попытка
		
		ДокументОбъект.Записать();
		
		GDS_РаспознаваниеВходящихПисем.ЗаписатьСоответсвие(ДокументОбъект.Ссылка, Письмо);
		
		ПрикрепитьФайлКВедомости(ДокументОбъект.Ссылка, ДвоичныеДанныеВложения, ИмяФайла);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
	Результат.Ведомость = ДокументОбъект.Ссылка;
	Возврат Результат;
	
КонецФункции

Процедура ПрикрепитьФайлКВедомости(Ведомость, ДвоичныеДанные, ИмяФайла)
	
	СоставИмени = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ИмяФайла);
	
	ПрисоединенныеФайлы = Новый Массив;
	РаботаСФайлами.ЗаполнитьПрисоединенныеФайлыКОбъекту(Ведомость, ПрисоединенныеФайлы);
	Для Каждого Файл Из ПрисоединенныеФайлы Цикл
		ИмяПрисоединенного = СтрШаблон("%1.%2", Файл.Наименование, Файл.Расширение);
		Если ИмяПрисоединенного = ИмяФайла Тогда
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыФайла = РаботаСФайлами.ПараметрыДобавленияФайла();
	ПараметрыФайла.ВладелецФайлов = Ведомость;
	ПараметрыФайла.ИмяБезРасширения = СоставИмени.ИмяБезРасширения;
	ПараметрыФайла.РасширениеБезТочки = СтрЗаменить(СоставИмени.Расширение, ".", "");
	ПараметрыФайла.ВремяИзмененияУниверсальное = ТекущаяУниверсальнаяДата();
	
	АдресВХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	НоваяСсылкаНаФайл = РаботаСФайлами.НоваяСсылкаНаФайл(Ведомость);
	РаботаСФайлами.ДобавитьФайл(ПараметрыФайла, АдресВХранилище, , , НоваяСсылкаНаФайл);
	
КонецПроцедуры

Функция ПолучитьПутьКУтилитеQR()
	
	Если ЗначениеЗаполнено(ПутьКУтилитеQR) Тогда
		ФайлКомпоненты = Новый Файл(ПутьКУтилитеQR);
		Если ФайлКомпоненты.Существует() Тогда
			Возврат ПутьКУтилитеQR;
		КонецЕсли;
	КонецЕсли;
	
	ДвоичныеДанныеУтилиты = ПолучитьМакет("КомпонентаQR");
	Если ДвоичныеДанныеУтилиты = Неопределено Или ДвоичныеДанныеУтилиты.Размер() = 0 Тогда
		ВызватьИсключение НСтр(
			"ru = 'Макет ""КомпонентаQR"" пуст. Поместите утилиту QRCodeRecognizer (ZXing/gozxing) в макет обработки.'");
	КонецЕсли;
	
	ПутьКУтилитеQR = ПолучитьИмяВременногоФайла("exe");
	ДвоичныеДанныеУтилиты.Записать(ПутьКУтилитеQR);
	
	Возврат ПутьКУтилитеQR;
	
КонецФункции

Функция ВызватьРаспознаваниеQR(ДвоичныеДанные, РасширениеКартинки)
	
	ИмяКартинки = "";
	QRСтрока = "";
	
	Попытка
		
		ИмяКартинки = ПолучитьИмяВременногоФайла(РасширениеКартинки);
		ДвоичныеДанные.Записать(ИмяКартинки);
		
		КомандаЗапуска = Новый Массив;
		КомандаЗапуска.Добавить(ПолучитьПутьКУтилитеQR());
		КомандаЗапуска.Добавить(ИмяКартинки);
		
		ПараметрыЗапуска = ФайловаяСистема.ПараметрыЗапускаПрограммы();
		ПараметрыЗапуска.ДождатьсяЗавершения = Истина;
		ПараметрыЗапуска.ПолучитьПотокВывода = Истина;
		// QRCodeRecognizer (gozxing) пишет stdout в UTF-8; на Windows по умолчанию — CP866.
		ПараметрыЗапуска.КодировкаПотоков = КодировкаТекста.UTF8;
		ПараметрыЗапуска.КодировкаИсполнения = "UTF8";
		
		РезультатЗапуска = ФайловаяСистема.ЗапуститьПрограмму(КомандаЗапуска, ПараметрыЗапуска);
		
		Если РезультатЗапуска.КодВозврата = 0 Тогда
			QRСтрока = СокрП(РезультатЗапуска.ПотокВывода);
		КонецЕсли;
		
	Исключение
		
		Если ИмяКартинки <> "" Тогда
			УдалитьФайлы(ИмяКартинки);
		КонецЕсли;
		
		ВызватьИсключение;
		
	КонецПопытки;
	
	Если ИмяКартинки <> "" Тогда
		УдалитьФайлы(ИмяКартинки);
	КонецЕсли;
	
	Возврат QRСтрока;
	
КонецФункции

Функция ПреобразоватьPDFВPNG(ДвоичныеДанныеPDF)
	
	ИмяPDF = "";
	ИмяPNG = "";
	
	Попытка
		
		ИмяPDF = ПолучитьИмяВременногоФайла("pdf");
		ИмяPNG = ПолучитьИмяВременногоФайла("png");
		ДвоичныеДанныеPDF.Записать(ИмяPDF);
		
		ПутьКImageMagick = ПутьКImageMagick();
		Команда = СтрШаблон("""%1"" -density 200 ""%2[0]"" ""%3""", ПутьКImageMagick, ИмяPDF, ИмяPNG);
		
		КодВозврата = Неопределено;
		ЗапуститьПриложение(Команда, , Истина, КодВозврата);
		
		Если КодВозврата <> 0 Тогда
			Файл = Новый Файл(ИмяPNG);
			Если Не Файл.Существует() Тогда
				ВызватьИсключение НСтр(
					"ru = 'Не удалось преобразовать PDF в изображение. Установите ImageMagick на сервере 1С.'");
			КонецЕсли;
		КонецЕсли;
		
		ДвоичныеДанныеPNG = Новый ДвоичныеДанные(ИмяPNG);
		
		УдалитьФайлы(ИмяPDF);
		УдалитьФайлы(ИмяPNG);
		
		Возврат ДвоичныеДанныеPNG;
		
	Исключение
		
		Если ИмяPDF <> "" Тогда
			УдалитьФайлы(ИмяPDF);
		КонецЕсли;
		
		Если ИмяPNG <> "" Тогда
			УдалитьФайлы(ИмяPNG);
		КонецЕсли;
		
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецФункции

Функция ПутьКImageMagick()
	
	НастройкиСканирования = РаботаСФайлами.ПолучитьНастройкиСканированияПользователя("");
	ПутьКПрограмме = НастройкиСканирования.ПутьКПрограммеКонвертации;
	
	Если ЗначениеЗаполнено(ПутьКПрограмме) Тогда
		Возврат ПутьКПрограмме;
	КонецЕсли;
	
	Возврат "magick";
	
КонецФункции

Функция ДопустимоеРасширениеВложения(Расширение)
	
	Возврат Расширение = "jpg"
		Или Расширение = "jpeg"
		Или Расширение = "png"
		Или Расширение = "pdf";
	
КонецФункции

Функция РасширениеФайла(ИмяФайла)
	
	ПозицияТочки = СтрНайти(ИмяФайла, ".", НаправлениеПоиска.СКонца);
	Если ПозицияТочки = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат Сред(ИмяФайла, ПозицияТочки + 1);
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
